espressif/esp-idf/components/soc/esp32h4/register/soc/spi_struct.h
/** Type of user2 register
 *  SPI USER control register 2
 */
typedef union {
    struct {
        /** usr_command_value : R/W; bitpos: [15:0]; default: 0;
         *  Configures the command value.
         *  Can be configured in CONF state.
         */
        uint32_t usr_command_value:16;
        uint32_t reserved_16:11;
        /** mst_rempty_err_end_en : R/W; bitpos: [27]; default: 1;
         *  Configures whether or not to end the SPI transfer when SPI TX AFIFO read empty
         *  error occurs in master full-/half-duplex transfers.
         *  0: Not end
         *  1: End
         */
        uint32_t mst_rempty_err_end_en:1;
        /** usr_command_bitlen : R/W; bitpos: [31:28]; default: 7;
         *  Configures the bit length of command state.
         *  This value is (expected bit number - 1). Can be configured in CONF state.
         */
        uint32_t usr_command_bitlen:4;
    };
    uint32_t val;
} spi_user2_reg_t;


/** Group: Control and configuration registers */
/** Type of ctrl register
 *  SPI control register
 */
typedef union {
    struct {
        uint32_t reserved_0:3;
        /** dummy_out : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to output the FSPI bus signals in DUMMY state.
         *  0: Not output
         *  1: Output
         *  Can be configured in CONF state.
         */
        uint32_t dummy_out:1;
        uint32_t reserved_4:1;
        /** faddr_dual : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to enable 2-bit mode during address (ADDR) state.
         *  0: Disable
         *  1: Enable
         *  Can be configured in CONF state.
         */
        uint32_t faddr_dual:1;
        /** faddr_quad : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to enable 4-bit mode during address (ADDR) state.
         *  0: Disable
         *  1: Enable
         *  Can be configured in CONF state.
         */
        uint32_t faddr_quad:1;
        /** faddr_oct : HRO; bitpos: [7]; default: 0;
         *  Configures whether or not to enable 8-bit mode during address (ADDR) state.
         *  0: Disable
         *  1: Enable
         *  Can be configured in CONF state.
         */
        uint32_t faddr_oct:1;
        /** fcmd_dual : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to enable 2-bit mode during command (CMD) state.
         *  0: Disable
         *  1: Enable
         *  Can be configured in CONF state.
         */
        uint32_t fcmd_dual:1;
        /** fcmd_quad : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to enable 4-bit mode during command (CMD) state.
         *  0: Disable
         *  1: Enable
         *  Can be configured in CONF state.
         */
        uint32_t fcmd_quad:1;
        /** fcmd_oct : HRO; bitpos: [10]; default: 0;
         *  Configures whether or not to enable 8-bit mode during command (CMD) state.
         *  0: Disable
         *  1: Enable
         *  Can be configured in CONF state.
         */
        uint32_t fcmd_oct:1;
        uint32_t reserved_11:3;
        /** fread_dual : R/W; bitpos: [14]; default: 0;
         *  Configures whether or not to enable the 2-bit mode of read-data (DIN) state in read
         *  operations.
         *  0: Disable
         *  1: Enable
         *  Can be configured in CONF state.
         */
        uint32_t fread_dual:1;
        /** fread_quad : R/W; bitpos: [15]; default: 0;
         *  Configures whether or not to enable the 4-bit mode of read-data (DIN) state in read
         *  operations.
         *  0: Disable
         *  1: Enable
         *  Can be configured in CONF state.
         */
        uint32_t fread_quad:1;
        /** fread_oct : HRO; bitpos: [16]; default: 0;
         *  Configures whether or not to enable the 8-bit mode of read-data (DIN) state in read
         *  operations.
         *  0: Disable
         *  1: Enable
         *  Can be configured in CONF state.
         */
        uint32_t fread_oct:1;
        uint32_t reserved_17:1;
        /** q_pol : R/W; bitpos: [18]; default: 1;
         *  Configures MISO line polarity.
         *  0: Low
         *  1: High
         *  Can be configured in CONF state.
         */
        uint32_t q_pol:1;
        /** d_pol : R/W; bitpos: [19]; default: 1;
         *  Configures MOSI line polarity.
         *  0: Low
         *  1: High
         *  Can be configured in CONF state.
         */
        uint32_t d_pol:1;
        /** hold_pol : R/W; bitpos: [20]; default: 1;
         *  Configures SPI_HOLD output value when SPI is in idle.
         *  0: Output low
         *  1: Output high
         *  Can be configured in CONF state.
         */
        uint32_t hold_pol:1;
        /** wp_pol : R/W; bitpos: [21]; default: 1;
         *  Configures the output value of write-protect signal when SPI is in idle.
         *  0: Output low
         *  1: Output high
         *  Can be configured in CONF state.
         */
        uint32_t wp_pol:1;
        uint32_t reserved_22:1;
        /** rd_bit_order : R/W; bitpos: [24:23]; default: 0;
         *  Configures the bit order in read-data (MISO) state.
         *  0: MSB first
         *  1: LSB first
         *  Can be configured in CONF state.
         */
        uint32_t rd_bit_order:2;
        /** wr_bit_order : R/W; bitpos: [26:25]; default: 0;
         *  Configures the bit order in command (CMD), address (ADDR), and write-data (MOSI)
         *  states.
         *  0: MSB first
         *  1: LSB first
         *  Can be configured in CONF state.
         */
        uint32_t wr_bit_order:2;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} spi_ctrl_reg_t;

/** Type of ms_dlen register
 *  SPI data bit length control register
 */
typedef union {
    struct {
        /** ms_data_bitlen : R/W; bitpos: [17:0]; default: 0;
         *  Configures the data bit length of SPI transfer in DMA-controlled master transfer or
         *  in CPU-controlled master transfer. Or configures the bit length of SPI RX transfer
         *  in DMA-controlled slave transfer.
         *  This value shall be (expected bit_num - 1). Can be configured in CONF state.
         */
        uint32_t ms_data_bitlen:18;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} spi_ms_dlen_reg_t;

