espressif/esp-idf/components/soc/esp32h4/register/soc/spi_struct.h
/** Type of misc register
 *  SPI misc register
 */
typedef union {
    struct {
        /** cs0_dis : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to disable SPI_CS$n pin.
         *  0: SPI_CS$n signal is from/to SPI_CS$n pin.
         *  1: Disable SPI_CS$n pin.
         *  Can be configured in CONF state.
         */
        uint32_t cs0_dis:1;
        /** cs1_dis : R/W; bitpos: [1]; default: 1;
         *  Configures whether or not to disable SPI_CS$n pin.
         *  0: SPI_CS$n signal is from/to SPI_CS$n pin.
         *  1: Disable SPI_CS$n pin.
         *  Can be configured in CONF state.
         */
        uint32_t cs1_dis:1;
        /** cs2_dis : R/W; bitpos: [2]; default: 1;
         *  Configures whether or not to disable SPI_CS$n pin.
         *  0: SPI_CS$n signal is from/to SPI_CS$n pin.
         *  1: Disable SPI_CS$n pin.
         *  Can be configured in CONF state.
         */
        uint32_t cs2_dis:1;
        /** cs3_dis : R/W; bitpos: [3]; default: 1;
         *  Configures whether or not to disable SPI_CS$n pin.
         *  0: SPI_CS$n signal is from/to SPI_CS$n pin.
         *  1: Disable SPI_CS$n pin.
         *  Can be configured in CONF state.
         */
        uint32_t cs3_dis:1;
        /** cs4_dis : R/W; bitpos: [4]; default: 1;
         *  Configures whether or not to disable SPI_CS$n pin.
         *  0: SPI_CS$n signal is from/to SPI_CS$n pin.
         *  1: Disable SPI_CS$n pin.
         *  Can be configured in CONF state.
         */
        uint32_t cs4_dis:1;
        /** cs5_dis : R/W; bitpos: [5]; default: 1;
         *  Configures whether or not to disable SPI_CS$n pin.
         *  0: SPI_CS$n signal is from/to SPI_CS$n pin.
         *  1: Disable SPI_CS$n pin.
         *  Can be configured in CONF state.
         */
        uint32_t cs5_dis:1;
        /** ck_dis : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to disable SPI_CLK output.
         *  0: Enable
         *  1: Disable
         *  Can be configured in CONF state.
         */
        uint32_t ck_dis:1;
        /** master_cs_pol : R/W; bitpos: [12:7]; default: 0;
         *  Configures the polarity of SPI_CS$n ($n = 0-5) line in master transfer.
         *  0: SPI_CS$n is low active.
         *  1: SPI_CS$n is high active.
         *  Can be configured in CONF state.
         */
        uint32_t master_cs_pol:6;
        uint32_t reserved_13:3;
        /** clk_data_dtr_en : HRO; bitpos: [16]; default: 0;
         *  1: SPI master DTR mode is applied to SPI clk, data and spi_dqs.  0: SPI master DTR
         *  mode is  only applied to spi_dqs. This bit should be used with bit 17/18/19.
         */
        uint32_t clk_data_dtr_en:1;
        /** data_dtr_en : HRO; bitpos: [17]; default: 0;
         *  1: SPI clk and data of SPI_DOUT and SPI_DIN state are in DTR mode, including master
         *  1/2/4/8-bm.  0:  SPI clk and data of SPI_DOUT and SPI_DIN state are in STR mode.
         *  Can be configured in CONF state.
         */
        uint32_t data_dtr_en:1;
        /** addr_dtr_en : HRO; bitpos: [18]; default: 0;
         *  1: SPI clk and data of SPI_SEND_ADDR state are in DTR mode, including master
         *  1/2/4/8-bm.  0:  SPI clk and data of SPI_SEND_ADDR state are in STR mode. Can be
         *  configured in CONF state.
         */
        uint32_t addr_dtr_en:1;
        /** cmd_dtr_en : HRO; bitpos: [19]; default: 0;
         *  1: SPI clk and data of SPI_SEND_CMD state are in DTR mode, including master
         *  1/2/4/8-bm. 0:  SPI clk and data of SPI_SEND_CMD state are in STR mode. Can be
         *  configured in CONF state.
         */
        uint32_t cmd_dtr_en:1;
        uint32_t reserved_20:3;
        /** slave_cs_pol : R/W; bitpos: [23]; default: 0;
         *  Configures whether or not invert SPI slave input CS polarity.
         *  0: Not change
         *  1: Invert
         *  Can be configured in CONF state.
         */
        uint32_t slave_cs_pol:1;
        /** dqs_idle_edge : HRO; bitpos: [24]; default: 0;
         *  The default value of spi_dqs. Can be configured in CONF state.
         */
        uint32_t dqs_idle_edge:1;
        uint32_t reserved_25:4;
        /** ck_idle_edge : R/W; bitpos: [29]; default: 0;
         *  Configures the level of SPI_CLK line when GP-SPI2 is in idle.
         *  0: Low
         *  1: High
         *  Can be configured in CONF state.
         */
        uint32_t ck_idle_edge:1;
        /** cs_keep_active : R/W; bitpos: [30]; default: 0;
         *  Configures whether or not to keep the SPI_CS line low.
         *  0: Not keep low
         *  1: Keep low
         *  Can be configured in CONF state.
         */
        uint32_t cs_keep_active:1;
        /** quad_din_pin_swap : R/W; bitpos: [31]; default: 0;
         *  1: SPI quad input swap enable, swap FSPID with FSPIQ, swap FSPIWP with FSPIHD. 0:
         *  spi quad input swap disable. Can be configured in CONF state.
         */
        uint32_t quad_din_pin_swap:1;
    };
    uint32_t val;
} spi_misc_reg_t;

/** Type of dma_conf register
 *  SPI DMA control register
 */
typedef union {
    struct {
        /** dma_outfifo_empty : RO; bitpos: [0]; default: 1;
         *  Represents whether or not the DMA TX FIFO is ready for sending data.
         *  0: Ready
         *  1: Not ready
         */
        uint32_t dma_outfifo_empty:1;
        /** dma_infifo_full : RO; bitpos: [1]; default: 1;
         *  Represents whether or not the DMA RX FIFO is ready for receiving data.
         *  0: Ready
         *  1: Not ready
         */
        uint32_t dma_infifo_full:1;
        uint32_t reserved_2:16;
        /** dma_slv_seg_trans_en : R/W; bitpos: [18]; default: 0;
         *  Configures whether or not to enable DMA-controlled segmented transfer in slave
         *  half-duplex communication.
         *  0: Disable
         *  1: Enable
         */
        uint32_t dma_slv_seg_trans_en:1;
        /** slv_rx_seg_trans_clr_en : R/W; bitpos: [19]; default: 0;
         *  In slave segmented transfer, if the size of the DMA RX buffer is smaller than the
         *  size of the received data,
         *  1: the data in all the following Wr_DMA transactions will not be received
         *  0: the data in this Wr_DMA transaction will not be received, but in the following
         *  transactions,
         *  - if the size of DMA RX buffer is not 0, the data in following Wr_DMA transactions
         *  will be received.
         *  - if the size of DMA RX buffer is 0, the data in following Wr_DMA transactions will
         *  not be received.
         */
        uint32_t slv_rx_seg_trans_clr_en:1;
        /** slv_tx_seg_trans_clr_en : R/W; bitpos: [20]; default: 0;
         *  In slave segmented transfer, if the size of the DMA TX buffer is smaller than the
         *  size of the transmitted data,
         *  1: the data in the following transactions will not be updated, i.e. the old data is
         *  transmitted repeatedly.
         *  0: the data in this transaction will not be updated. But in the following
         *  transactions,
         *  - if new data is filled in DMA TX FIFO, new data will be transmitted.
         *  - if no new data is filled in DMA TX FIFO, no new data will be transmitted.
         */
        uint32_t slv_tx_seg_trans_clr_en:1;
        /** rx_eof_en : R/W; bitpos: [21]; default: 0;
         *  1: In a DAM-controlled transfer, if the bit number of transferred data is equal to
         *  (SPI_MS_DATA_BITLEN + 1), then GDMA_IN_SUC_EOF_CH\it{n}_INT_RAW will be set by
         *  hardware. 0: GDMA_IN_SUC_EOF_CH\it{n}_INT_RAW is set by SPI_TRANS_DONE_INT event in
         *  a single transfer, or by an SPI_DMA_SEG_TRANS_DONE_INT event in a segmented
         *  transfer.
         */
        uint32_t rx_eof_en:1;
        uint32_t reserved_22:5;
        /** dma_rx_ena : R/W; bitpos: [27]; default: 0;
         *  Configures whether or not to enable DMA-controlled receive data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t dma_rx_ena:1;
        /** dma_tx_ena : R/W; bitpos: [28]; default: 0;
         *  Configures whether or not to enable DMA-controlled send data transfer.
         *  0: Disable
         *  1: Enable
         */
        uint32_t dma_tx_ena:1;
        /** rx_afifo_rst : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to reset spi_rx_afifo as shown in Figure .
         *  0: Not reset
         *  1: Reset
         *  spi_rx_afifo is used to receive data in SPI master and slave transfer.
         */
        uint32_t rx_afifo_rst:1;
        /** buf_afifo_rst : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to reset buf_tx_afifo as shown in Figure .
         *  0: Not reset
         *  1: Reset
         *  buf_tx_afifo is used to send data out in CPU-controlled master and slave transfer.
         */
        uint32_t buf_afifo_rst:1;
        /** dma_afifo_rst : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to reset dma_tx_afifo as shown in Figure .
         *  0: Not reset
         *  1: Reset
         *  dma_tx_afifo is used to send data out in DMA-controlled slave transfer.
         */
        uint32_t dma_afifo_rst:1;
    };
    uint32_t val;
} spi_dma_conf_reg_t;

/** Type of slave register
 *  SPI slave control register
 */
typedef union {
    struct {
        /** clk_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures SPI clock mode.
         *  0: SPI clock is off when CS becomes inactive.
         *  1: SPI clock is delayed one cycle after CS becomes inactive.
         *  2: SPI clock is delayed two cycles after CS becomes inactive.
         *  3: SPI clock is always on.
         *  Can be configured in CONF state.
         */
        uint32_t clk_mode:2;
        /** clk_mode_13 : R/W; bitpos: [2]; default: 0;
         *  Configure clock mode.
         *  0: Support SPI clock mode 0 or 2. See Table .
         *  1: Support SPI clock mode 1 or 3. See Table .
         */
        uint32_t clk_mode_13:1;
        /** rsck_data_out : R/W; bitpos: [3]; default: 0;
         *  Configures the edge of output data.
         *  0: Output data at TSCK rising edge.
         *  1: Output data at RSCK rising edge.
         */
        uint32_t rsck_data_out:1;
        uint32_t reserved_4:4;
        /** slv_rddma_bitlen_en : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length
         *  of Rd_DMA transfer.
         *  0: Not use
         *  1: Use
         */
        uint32_t slv_rddma_bitlen_en:1;
        /** slv_wrdma_bitlen_en : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length
         *  of Wr_DMA transfer.
         *  0: Not use
         *  1: Use
         */
        uint32_t slv_wrdma_bitlen_en:1;
        /** slv_rdbuf_bitlen_en : R/W; bitpos: [10]; default: 0;
         *  Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length
         *  of Rd_BUF transfer.
         *  0: Not use
         *  1: Use
         */
        uint32_t slv_rdbuf_bitlen_en:1;
        /** slv_wrbuf_bitlen_en : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length
         *  of Wr_BUF transfer.
         *  0: Not use
         *  1: Use
         */
        uint32_t slv_wrbuf_bitlen_en:1;
        /** slv_last_byte_strb : R/SS; bitpos: [19:12]; default: 0;
         *  Represents the effective bit of the last received data byte in SPI slave FD and HD
         *  mode.
         */
        uint32_t slv_last_byte_strb:8;
        uint32_t reserved_20:2;
        /** dma_seg_magic_value : R/W; bitpos: [25:22]; default: 10;
         *  Configures the magic value of BM table in DMA-controlled configurable segmented
         *  transfer.
         */
        uint32_t dma_seg_magic_value:4;
        /** slave_mode : R/W; bitpos: [26]; default: 0;
         *  Configures SPI work mode.
         *  0: Master
         *  1: Slave
         */
        uint32_t slave_mode:1;
        /** soft_reset : WT; bitpos: [27]; default: 0;
         *  Configures whether to reset the SPI clock line, CS line, and data line via software.
         *  0: Not reset
         *  1: Reset
         *  Can be configured in CONF state.
         */
        uint32_t soft_reset:1;
        /** usr_conf : R/W; bitpos: [28]; default: 0;
         *  Configures whether or not to enable the CONF state of current DMA-controlled
         *  configurable segmented transfer.
         *  0: No effect, which means the current transfer is not a configurable segmented
         *  transfer.
         *  1: Enable, which means a configurable segmented transfer is started.
         */
        uint32_t usr_conf:1;
        /** mst_fd_wait_dma_tx_data : R/W; bitpos: [29]; default: 0;
         *  Configures whether or not to wait DMA TX data gets ready before starting SPI
         *  transfer in master full-duplex transfer.
         *  0: Not wait
         *  1: Wait
         */
        uint32_t mst_fd_wait_dma_tx_data:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} spi_slave_reg_t;

/** Type of slave1 register
 *  SPI slave control register 1
 */
typedef union {
    struct {
        /** slv_data_bitlen : R/W/SS; bitpos: [17:0]; default: 0;
         *  Configures the transferred data bit length in SPI slave full-/half-duplex modes.
         */
        uint32_t slv_data_bitlen:18;
        /** slv_last_command : R/W/SS; bitpos: [25:18]; default: 0;
         *  Configures the command value in slave mode.
         */
        uint32_t slv_last_command:8;
        /** slv_last_addr : R/W/SS; bitpos: [31:26]; default: 0;
         *  Configures the address value in slave mode.
         */
        uint32_t slv_last_addr:6;
    };
    uint32_t val;
} spi_slave1_reg_t;


/** Group: Clock control registers */
/** Type of clock register
 *  SPI clock control register
 */
typedef union {
    struct {
        /** clkcnt_l : R/W; bitpos: [5:0]; default: 3;
         *  In master transfer, this field must be equal to SPI_CLKCNT_N. In slave mode, it
         *  must be 0. Can be configured in CONF state.
         */
        uint32_t clkcnt_l:6;
        /** clkcnt_h : R/W; bitpos: [11:6]; default: 1;
         *  Configures the duty cycle of SPI_CLK (high level) in master transfer.
         *  It's recommended to configure this value to floor((SPI_CLKCNT_N + 1)/2 - 1).
         *  floor() here is to round a number down, e.g., floor(2.2) = 2. In slave mode, it
         *  must be 0.
         *  Can be configured in CONF state.
         */
        uint32_t clkcnt_h:6;
        /** clkcnt_n : R/W; bitpos: [17:12]; default: 3;
         *  Configures the divider of SPI_CLK in master transfer.
         *  SPI_CLK frequency is $f_{\textrm{apb_clk}}$/(SPI_CLKDIV_PRE + 1)/(SPI_CLKCNT_N +
         *  1).
         *  Can be configured in CONF state.
         */
        uint32_t clkcnt_n:6;
        /** clkdiv_pre : R/W; bitpos: [21:18]; default: 0;
         *  Configures the pre-divider of SPI_CLK in master transfer.
         *  Can be configured in CONF state.
         */
        uint32_t clkdiv_pre:4;
        uint32_t reserved_22:8;
        /** clk_edge_sel : R/W; bitpos: [30]; default: 0;
         *  Configures use standard clock sampling edge or delay the sampling edge by half a
         *  cycle in master transfer.
         *  0: clock sampling edge is delayed by half a cycle.
         *  1: clock sampling edge is standard.
         *  Can be configured in CONF state.
         */
        uint32_t clk_edge_sel:1;
        /** clk_equ_sysclk : R/W; bitpos: [31]; default: 1;
         *  Configures whether or not the SPI_CLK is equal to APB_CLK in master transfer.
         *  0: SPI_CLK is divided from APB_CLK.
         *  1: SPI_CLK is equal to APB_CLK.
         *  Can be configured in CONF state.
         */
        uint32_t clk_equ_sysclk:1;
    };
    uint32_t val;
} spi_clock_reg_t;

/** Type of clk_gate register
 *  SPI module clock and register clock control
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable clock gate.
         *  0: Disable
         *  1: Enable
         */
        uint32_t clk_en:1;
        /** mst_clk_active : R/W; bitpos: [1]; default: 0;
         *  Set this bit to power on the SPI module clock.
         */
        uint32_t mst_clk_active:1;
        /** mst_clk_sel : R/W; bitpos: [2]; default: 0;
         *  This bit is used to select SPI module clock source in master mode. 1: PLL_CLK_80M.
         *  0: XTAL CLK.
         */
        uint32_t mst_clk_sel:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} spi_clk_gate_reg_t;


/** Group: Timing registers */
/** Type of din_mode register
 *  SPI input delay mode configuration
 */
typedef union {
    struct {
        /** din0_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures the input mode for FSPID signal.
         *  0: Input without delay
         *  1: Input at the (SPI_DIN0_NUM + 1)th falling edge of clk_spi_mst
         *  2: Input at the (SPI_DIN0_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst
         *  rising edge cycle
         *  3: Input at the (SPI_DIN0_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst
         *  falling edge cycle
         *  Can be configured in CONF state.
         */
        uint32_t din0_mode:2;
        /** din1_mode : R/W; bitpos: [3:2]; default: 0;
         *  Configures the input mode for FSPIQ signal.
         *  0: Input without delay
         *  1: Input at the (SPI_DIN1_NUM+1)th falling edge of clk_spi_mst
         *  2: Input at the (SPI_DIN1_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst
         *  rising edge cycle
         *  3: Input at the (SPI_DIN1_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst
         *  falling edge cycle
         *  Can be configured in CONF state.
         */
        uint32_t din1_mode:2;
        /** din2_mode : R/W; bitpos: [5:4]; default: 0;
         *  Configures the input mode for FSPIWP signal.
         *  0: Input without delay
         *  1: Input at the (SPI_DIN2_NUM + 1)th falling edge of clk_spi_mst
         *  2: Input at the (SPI_DIN2_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst
         *  rising edge cycle
         *  3: Input at the (SPI_DIN2_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst
         *  falling edge cycle
         *  Can be configured in CONF state.
         */
        uint32_t din2_mode:2;
        /** din3_mode : R/W; bitpos: [7:6]; default: 0;
         *  Configures the input mode for FSPIHD signal.
         *  0: Input without delay
         *  1: Input at the (SPI_DIN3_NUM + 1)th falling edge of clk_spi_mst
         *  2: Input at the (SPI_DIN3_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst
         *  rising edge cycle
         *  3: Input at the (SPI_DIN3_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst
         *  falling edge cycle
         *  Can be configured in CONF state.
         *
         */
        uint32_t din3_mode:2;
        /** din4_mode : HRO; bitpos: [9:8]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
         *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
         *  with the spi_clk. Can be configured in CONF state.
         */
        uint32_t din4_mode:2;
        /** din5_mode : HRO; bitpos: [11:10]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
         *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
         *  with the spi_clk. Can be configured in CONF state.
         */
        uint32_t din5_mode:2;
        /** din6_mode : HRO; bitpos: [13:12]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
         *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
         *  with the spi_clk. Can be configured in CONF state.
         */
        uint32_t din6_mode:2;
        /** din7_mode : HRO; bitpos: [15:14]; default: 0;
         *  the input signals are delayed by SPI module clock cycles, 0: input without delayed,
         *  1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input
         *  with the spi_clk. Can be configured in CONF state.
         */
        uint32_t din7_mode:2;
        /** timing_hclk_active : R/W; bitpos: [16]; default: 0;
         *  Configures whether or not to enable HCLK (high-frequency clock) in SPI input timing
         *  module.
         *  0: Disable
         *  1: Enable
         *  Can be configured in CONF state.
         */
        uint32_t timing_hclk_active:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} spi_din_mode_reg_t;

